<?php

// Συνδεση στη βάση δεδομένων
$dbhost = "localhost"; // Ο server της βάσης δεδομένων
$dbuser = "root";      // Το όνομα χρήστη της βάσης δεδομένων
$dbpass = "";          // Ο κωδικός χρήστη της βάσης δεδομένων
$dbname = "dailypulse"; // Το όνομα της βάσης δεδομένων που χρησιμοποιείτε

// Προσπαθήστε να συνδεθείτε στη βάση δεδομένων
$conn = mysqli_connect($dbhost, $dbuser, $dbpass, $dbname);

// Έλεγχος αν η σύνδεση έχει επιτυχής ή απέτυχε
if (!isset($conn)) {
    echo die("Database connection failed"); // Εάν η σύνδεση απέτυχε, εμφανίστε ένα μήνυμα σφάλματος
}

?>
