<?php
// Παραμετροποίηση της σύνδεσης προς τη βάση δεδομένων
$dbhost = "localhost";  // Η διεύθυνση του διακομιστή βάσης δεδομένων
$dbuser = "root";       // Ο χρήστης της βάσης δεδομένων
$dbpass = "";           // Ο κωδικός πρόσβασης του χρήστη
$dbname = "dailypulse";  // Το όνομα της βάσης δεδομένων

// Σύνδεση στη βάση δεδομένων
$conn = mysqli_connect($dbhost, $dbuser, $dbpass, $dbname);

// Έλεγχος αν η σύνδεση επιτυχής
if (!isset($conn)) {
    echo die("Database connection failed"); // Αν η σύνδεση αποτύχει, εμφανίζεται μήνυμα σφάλματος
}
?>
